import z from "zod";

export const passwordRegex =
  /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@#$%^&+=]).{6,}$/;

export const studentRegister = z.object({
  username: z.string().min(2, "Слишком короткое").max(50, "Слишком длинное"),
  email: z
    .email({ message: "Недействительный адрес электронной почты" })
    .min(1, "Введите электронную почту")
    .max(50, "Слишком длинный"),
  password: z
    .string()
    .min(6, "Пароль должен содержать не менее 6 символов")
    .max(100, "Пароль не должен превышать 100 символов")
    .regex(
      passwordRegex,
      `Пароль должен содержать:
- как минимум одну строчную букву
- одну заглавную букву
- одну цифру
- один специальный символ (@#$%^&+=)
- быть не короче 8 символов`,
    ),
  groupId: z.string({ error: "Выберите группу" }),
});
